veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxDma_reg.h
/** \brief 2A0C, DMARAM Channel 80 Destination Address Register */
#define DMA_CH80_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A0Cu)
/** Alias (User Manual Name) for DMA_CH80_DADR.
* To use register names with standard convension, please use DMA_CH80_DADR.
*/
#define DMA_DADR080 (DMA_CH80_DADR)

/** \brief 2A10, DMARAM Channel 80 Address and Interrupt Control Register */
#define DMA_CH80_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A10u)
/** Alias (User Manual Name) for DMA_CH80_ADICR.
* To use register names with standard convension, please use DMA_CH80_ADICR.
*/
#define DMA_ADICR080 (DMA_CH80_ADICR)

/** \brief 2A14, DMARAM Channel 80 Configuration Register */
#define DMA_CH80_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A14u)
/** Alias (User Manual Name) for DMA_CH80_CHCFGR.
* To use register names with standard convension, please use DMA_CH80_CHCFGR.
*/
#define DMA_CHCFGR080 (DMA_CH80_CHCFGR)

/** \brief 2A18, DMARAM Channel 80 Shadow Address Register */
#define DMA_CH80_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A18u)
/** Alias (User Manual Name) for DMA_CH80_SHADR.
* To use register names with standard convension, please use DMA_CH80_SHADR.
*/
#define DMA_SHADR080 (DMA_CH80_SHADR)

/** \brief 2A1C, DMARAM Channel 80 Control and Status Register */
#define DMA_CH80_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A1Cu)
/** Alias (User Manual Name) for DMA_CH80_CHCSR.
* To use register names with standard convension, please use DMA_CH80_CHCSR.
*/
#define DMA_CHCSR080 (DMA_CH80_CHCSR)

/** \brief 2A20, DMARAM Channel 81 Read Data CRC Register */
#define DMA_CH81_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A20u)
/** Alias (User Manual Name) for DMA_CH81_RDCRCR.
* To use register names with standard convension, please use DMA_CH81_RDCRCR.
*/
#define DMA_RDCRCR081 (DMA_CH81_RDCRCR)

/** \brief 2A24, DMARAM Channel 81 Source and Destination Address CRC Register */
#define DMA_CH81_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A24u)
/** Alias (User Manual Name) for DMA_CH81_SDCRCR.
* To use register names with standard convension, please use DMA_CH81_SDCRCR.
*/
#define DMA_SDCRCR081 (DMA_CH81_SDCRCR)

/** \brief 2A28, DMARAM Channel 81 Source Address Register */
#define DMA_CH81_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A28u)
/** Alias (User Manual Name) for DMA_CH81_SADR.
* To use register names with standard convension, please use DMA_CH81_SADR.
*/
#define DMA_SADR081 (DMA_CH81_SADR)

/** \brief 2A2C, DMARAM Channel 81 Destination Address Register */
#define DMA_CH81_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A2Cu)
/** Alias (User Manual Name) for DMA_CH81_DADR.
* To use register names with standard convension, please use DMA_CH81_DADR.
*/
#define DMA_DADR081 (DMA_CH81_DADR)

/** \brief 2A30, DMARAM Channel 81 Address and Interrupt Control Register */
#define DMA_CH81_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A30u)
/** Alias (User Manual Name) for DMA_CH81_ADICR.
* To use register names with standard convension, please use DMA_CH81_ADICR.
*/
#define DMA_ADICR081 (DMA_CH81_ADICR)

/** \brief 2A34, DMARAM Channel 81 Configuration Register */
#define DMA_CH81_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A34u)
/** Alias (User Manual Name) for DMA_CH81_CHCFGR.
* To use register names with standard convension, please use DMA_CH81_CHCFGR.
*/
#define DMA_CHCFGR081 (DMA_CH81_CHCFGR)

/** \brief 2A38, DMARAM Channel 81 Shadow Address Register */
#define DMA_CH81_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A38u)
/** Alias (User Manual Name) for DMA_CH81_SHADR.
* To use register names with standard convension, please use DMA_CH81_SHADR.
*/
#define DMA_SHADR081 (DMA_CH81_SHADR)

/** \brief 2A3C, DMARAM Channel 81 Control and Status Register */
#define DMA_CH81_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A3Cu)
/** Alias (User Manual Name) for DMA_CH81_CHCSR.
* To use register names with standard convension, please use DMA_CH81_CHCSR.
*/
#define DMA_CHCSR081 (DMA_CH81_CHCSR)

/** \brief 2A40, DMARAM Channel 82 Read Data CRC Register */
#define DMA_CH82_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A40u)
/** Alias (User Manual Name) for DMA_CH82_RDCRCR.
* To use register names with standard convension, please use DMA_CH82_RDCRCR.
*/
#define DMA_RDCRCR082 (DMA_CH82_RDCRCR)

/** \brief 2A44, DMARAM Channel 82 Source and Destination Address CRC Register */
#define DMA_CH82_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A44u)
/** Alias (User Manual Name) for DMA_CH82_SDCRCR.
* To use register names with standard convension, please use DMA_CH82_SDCRCR.
*/
#define DMA_SDCRCR082 (DMA_CH82_SDCRCR)

/** \brief 2A48, DMARAM Channel 82 Source Address Register */
#define DMA_CH82_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A48u)
/** Alias (User Manual Name) for DMA_CH82_SADR.
* To use register names with standard convension, please use DMA_CH82_SADR.
*/
#define DMA_SADR082 (DMA_CH82_SADR)

/** \brief 2A4C, DMARAM Channel 82 Destination Address Register */
#define DMA_CH82_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A4Cu)
/** Alias (User Manual Name) for DMA_CH82_DADR.
* To use register names with standard convension, please use DMA_CH82_DADR.
*/
#define DMA_DADR082 (DMA_CH82_DADR)

/** \brief 2A50, DMARAM Channel 82 Address and Interrupt Control Register */
#define DMA_CH82_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A50u)
/** Alias (User Manual Name) for DMA_CH82_ADICR.
* To use register names with standard convension, please use DMA_CH82_ADICR.
*/
#define DMA_ADICR082 (DMA_CH82_ADICR)

/** \brief 2A54, DMARAM Channel 82 Configuration Register */
#define DMA_CH82_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A54u)
/** Alias (User Manual Name) for DMA_CH82_CHCFGR.
* To use register names with standard convension, please use DMA_CH82_CHCFGR.
*/
#define DMA_CHCFGR082 (DMA_CH82_CHCFGR)

/** \brief 2A58, DMARAM Channel 82 Shadow Address Register */
#define DMA_CH82_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A58u)
/** Alias (User Manual Name) for DMA_CH82_SHADR.
* To use register names with standard convension, please use DMA_CH82_SHADR.
*/
#define DMA_SHADR082 (DMA_CH82_SHADR)

/** \brief 2A5C, DMARAM Channel 82 Control and Status Register */
#define DMA_CH82_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A5Cu)
/** Alias (User Manual Name) for DMA_CH82_CHCSR.
* To use register names with standard convension, please use DMA_CH82_CHCSR.
*/
#define DMA_CHCSR082 (DMA_CH82_CHCSR)

/** \brief 2A60, DMARAM Channel 83 Read Data CRC Register */
#define DMA_CH83_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A60u)
/** Alias (User Manual Name) for DMA_CH83_RDCRCR.
* To use register names with standard convension, please use DMA_CH83_RDCRCR.
*/
#define DMA_RDCRCR083 (DMA_CH83_RDCRCR)

/** \brief 2A64, DMARAM Channel 83 Source and Destination Address CRC Register */
#define DMA_CH83_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A64u)
/** Alias (User Manual Name) for DMA_CH83_SDCRCR.
* To use register names with standard convension, please use DMA_CH83_SDCRCR.
*/
#define DMA_SDCRCR083 (DMA_CH83_SDCRCR)

/** \brief 2A68, DMARAM Channel 83 Source Address Register */
#define DMA_CH83_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A68u)
/** Alias (User Manual Name) for DMA_CH83_SADR.
* To use register names with standard convension, please use DMA_CH83_SADR.
*/
#define DMA_SADR083 (DMA_CH83_SADR)

/** \brief 2A6C, DMARAM Channel 83 Destination Address Register */
#define DMA_CH83_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A6Cu)
/** Alias (User Manual Name) for DMA_CH83_DADR.
* To use register names with standard convension, please use DMA_CH83_DADR.
*/
#define DMA_DADR083 (DMA_CH83_DADR)

/** \brief 2A70, DMARAM Channel 83 Address and Interrupt Control Register */
#define DMA_CH83_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A70u)
/** Alias (User Manual Name) for DMA_CH83_ADICR.
* To use register names with standard convension, please use DMA_CH83_ADICR.
*/
#define DMA_ADICR083 (DMA_CH83_ADICR)

/** \brief 2A74, DMARAM Channel 83 Configuration Register */
#define DMA_CH83_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A74u)
/** Alias (User Manual Name) for DMA_CH83_CHCFGR.
* To use register names with standard convension, please use DMA_CH83_CHCFGR.
*/
#define DMA_CHCFGR083 (DMA_CH83_CHCFGR)

/** \brief 2A78, DMARAM Channel 83 Shadow Address Register */
#define DMA_CH83_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A78u)
/** Alias (User Manual Name) for DMA_CH83_SHADR.
* To use register names with standard convension, please use DMA_CH83_SHADR.
*/
#define DMA_SHADR083 (DMA_CH83_SHADR)

/** \brief 2A7C, DMARAM Channel 83 Control and Status Register */
#define DMA_CH83_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A7Cu)
/** Alias (User Manual Name) for DMA_CH83_CHCSR.
* To use register names with standard convension, please use DMA_CH83_CHCSR.
*/
#define DMA_CHCSR083 (DMA_CH83_CHCSR)

/** \brief 2A80, DMARAM Channel 84 Read Data CRC Register */
#define DMA_CH84_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A80u)
/** Alias (User Manual Name) for DMA_CH84_RDCRCR.
* To use register names with standard convension, please use DMA_CH84_RDCRCR.
*/
#define DMA_RDCRCR084 (DMA_CH84_RDCRCR)

/** \brief 2A84, DMARAM Channel 84 Source and Destination Address CRC Register */
#define DMA_CH84_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A84u)
/** Alias (User Manual Name) for DMA_CH84_SDCRCR.
* To use register names with standard convension, please use DMA_CH84_SDCRCR.
*/
#define DMA_SDCRCR084 (DMA_CH84_SDCRCR)

